beber007/escapement/Escapement/CORTEX-Mx/STM32/Escapement_Timer.c
/* Copyright (c) 2006-2012 MIS Institute of the HEIG-VD affiliated to the University of
** Applied Sciences of Western Switzerland. All rights reserved.
** Permission to use, copy, modify, and distribute this software and its documentation
** for any purpose, without fee, and without written agreement is hereby granted, pro-
** vided that the above copyright notice, the following three sentences and the authors
** appear in all copies of this software and in the software where it is used.
** IN NO EVENT SHALL THE MIS INSTITUTE NOR THE HEIG-VD NOR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL,
** INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS
** DOCUMENTATION, EVEN IF THE MIS INSTITUTE OR THE HEIG-VD OR THE UNIVERSITY OF APPLIED
** SCIENCES OF WESTERN SWITZERLAND HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
** THE MIS INSTITUTE, THE HEIG-VD AND THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWIT-
** ZERLAND SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
** IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFT-
** WARE PROVIDED HEREUNDER IS ON AN "AS IS" BASIS, AND THE MIS INSTITUTE NOR THE HEIG-VD
** AND NOR THE UNIVERSITY OF APPLIED SCIENCES OF WESTERN SWITZERLAND HAVE NO OBLIGATION
** TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
** Authors: MIS-TIC
**
** Escapement - Lightweight Power-Aware Real-Time OS, derived from ZottaOS.
** Modifications Copyright (c) 2026 Bertrand Hurst, distributed under the same terms;
** see LICENSE and NOTICE at the root of this repository.
*/
/* File Escapement_Timer.c: Hardware abstract timer layer. This file holds all timer related
**            functions needed by the Escapement family of kernels so that these can easily
**            be ported from one microcontroller to another.
** Platform version: All STM32 microcontrollers.
** Version date: March 2012
*/

#include "Escapement_CortexMx.h"
#include "Escapement.h"
#include "Escapement_Timer.h"


/* Define 16-bit or 32-bit timer */
#if defined(STM32F05XXX) && ESCAPEMENT_TIMER == OS_IO_TIM2 || \
    defined(STM32L1XXXX) && ESCAPEMENT_TIMER == OS_IO_TIM5 || \
    defined(STM32F2XXXX) && ESCAPEMENT_TIMER == OS_IO_TIM2 || \
    defined(STM32F2XXXX) && ESCAPEMENT_TIMER == OS_IO_TIM5 || \
    defined(STM32F4XXXX) && ESCAPEMENT_TIMER == OS_IO_TIM2 || \
    defined(STM32F4XXXX) && ESCAPEMENT_TIMER == OS_IO_TIM5
   #define ESCAPEMENT_TIMER_32
#else
   #define ESCAPEMENT_TIMER_16
#endif


/* Definitions of hardware registers */
#ifdef ESCAPEMENT_TIMER
   #if defined(STM32F05XXX)
      #if ESCAPEMENT_TIMER == OS_IO_TIM1
         #define TIME_BASE 0x40012C00
      #elif ESCAPEMENT_TIMER == OS_IO_TIM2
         #define TIME_BASE 0x40000000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM3
         #define TIME_BASE 0x40000400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM14
         #define TIME_BASE 0x40002000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM15
         #define TIME_BASE 0x40014000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM16
         #define TIME_BASE 0x40014400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM17
         #define TIME_BASE 0x40014800
      #else
         #error Selected timer does not exist! (verify ESCAPEMENT_TIMER defined in Escapement_Config.h)
      #endif
   #elif defined(STM32L1XXXX)
      #if ESCAPEMENT_TIMER == OS_IO_TIM2
         #define TIME_BASE 0x40000000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM3
         #define TIME_BASE 0x40000400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM4
         #define TIME_BASE 0x40000800
      #elif ESCAPEMENT_TIMER == OS_IO_TIM5
         #define TIME_BASE 0x40000C00
      #elif ESCAPEMENT_TIMER == OS_IO_TIM9
         #define TIME_BASE 0x40010800
      #elif ESCAPEMENT_TIMER == OS_IO_TIM10
         #define TIME_BASE 0x40010C00
      #elif ESCAPEMENT_TIMER == OS_IO_TIM11
         #define TIME_BASE 0x40011000
      #else
         #error Selected timer does not exist! (verify ESCAPEMENT_TIMER defined in Escapement_Config.h)
      #endif
   #elif defined(STM32F1XXXX)
      #if ESCAPEMENT_TIMER == OS_IO_TIM1
         #define TIME_BASE 0x40012C00
      #elif ESCAPEMENT_TIMER == OS_IO_TIM2
         #define TIME_BASE 0x40000000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM3
         #define TIME_BASE 0x40000400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM4
         #define TIME_BASE 0x40000800
      #elif ESCAPEMENT_TIMER == OS_IO_TIM5
         #define TIME_BASE 0x40000C00
      #elif ESCAPEMENT_TIMER == OS_IO_TIM8
         #define TIME_BASE 0x40013400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM9
         #define TIME_BASE 0x40014C00
      #elif ESCAPEMENT_TIMER == OS_IO_TIM10
         #define TIME_BASE 0x40015000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM11
         #define TIME_BASE 0x40015400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM12
         #define TIME_BASE 0x40001800
      #elif ESCAPEMENT_TIMER == OS_IO_TIM13
         #define TIME_BASE 0x40001C00
      #elif ESCAPEMENT_TIMER == OS_IO_TIM14
         #define TIME_BASE 0x40002000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM15
         #define TIME_BASE 0x40014000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM16
         #define TIME_BASE 0x40014400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM17
         #define TIME_BASE 0x40014800
      #else
         #error Selected timer does not exist! (verify ESCAPEMENT_TIMER defined in Escapement_Config.h)
      #endif
   #elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
      #if ESCAPEMENT_TIMER == OS_IO_TIM1
         #define TIME_BASE 0x40010000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM2
         #define TIME_BASE 0x40000000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM3
         #define TIME_BASE 0x40000400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM4
         #define TIME_BASE 0x40000800
      #elif ESCAPEMENT_TIMER == OS_IO_TIM5
         #define TIME_BASE 0x40000C00
      #elif ESCAPEMENT_TIMER == OS_IO_TIM8
         #define TIME_BASE 0x40010400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM9
         #define TIME_BASE 0x40014000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM10
         #define TIME_BASE 0x40014400
      #elif ESCAPEMENT_TIMER == OS_IO_TIM11
         #define TIME_BASE 0x40014800
      #elif ESCAPEMENT_TIMER == OS_IO_TIM12
         #define TIME_BASE 0x40001800
      #elif ESCAPEMENT_TIMER == OS_IO_TIM13
         #define TIME_BASE 0x40001C00
      #elif ESCAPEMENT_TIMER == OS_IO_TIM14
         #define TIME_BASE 0x40002000
      #else
         #error Selected timer does not exist! (verify ESCAPEMENT_TIMER defined in Escapement_Config.h)
      #endif
   #endif
#else
   #error You must select a timer for Escapement! (define ESCAPEMENT_TIMER in Escapement_Config.h)
#endif


#if defined(STM32F05XXX)
   #if ESCAPEMENT_TIMER == OS_IO_TIM1 || ESCAPEMENT_TIMER ==  OS_IO_TIM15 || \
       ESCAPEMENT_TIMER == OS_IO_TIM16 || ESCAPEMENT_TIMER == OS_IO_TIM17
      #define CLK_ENABLE *((volatile UINT32 *)0x40021018) // RCC_APB2ENR
      #if ESCAPEMENT_TIMER == OS_IO_TIM1
         #define CLK_ENABLE_BIT 0x0800
      #elif ESCAPEMENT_TIMER == OS_IO_TIM15
         #define CLK_ENABLE_BIT 0x10000
      #elif ESCAPEMENT_TIMER ==  OS_IO_TIM16
         #define CLK_ENABLE_BIT 0x20000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM17
         #define CLK_ENABLE_BIT 0x40000
      #endif
   #elif ESCAPEMENT_TIMER ==  OS_IO_TIM2 || ESCAPEMENT_TIMER == OS_IO_TIM3 || \
         ESCAPEMENT_TIMER == OS_IO_TIM14
      #define CLK_ENABLE *((volatile UINT32 *)0x4002101C) // RCC_APB1ENR
      #if ESCAPEMENT_TIMER ==  OS_IO_TIM2
         #define CLK_ENABLE_BIT 0x1
      #elif ESCAPEMENT_TIMER == OS_IO_TIM3
         #define CLK_ENABLE_BIT 0x2
      #elif ESCAPEMENT_TIMER == OS_IO_TIM14
         #define CLK_ENABLE_BIT 0x100
      #endif
   #endif
#elif defined(STM32L1XXXX)
   #if ESCAPEMENT_TIMER == OS_IO_TIM9 || ESCAPEMENT_TIMER ==  OS_IO_TIM10 || \
       ESCAPEMENT_TIMER == OS_IO_TIM11
      #define CLK_ENABLE *((volatile UINT32 *)0x40023820) // RCC_APB2ENR
      #if ESCAPEMENT_TIMER == OS_IO_TIM9
         #define CLK_ENABLE_BIT 0x4
      #elif ESCAPEMENT_TIMER ==  OS_IO_TIM10
         #define CLK_ENABLE_BIT 0x8
      #elif ESCAPEMENT_TIMER == OS_IO_TIM11
         #define CLK_ENABLE_BIT 0x10
      #endif
   #elif ESCAPEMENT_TIMER ==  OS_IO_TIM2 || ESCAPEMENT_TIMER == OS_IO_TIM3 || \
         ESCAPEMENT_TIMER == OS_IO_TIM4 || ESCAPEMENT_TIMER == OS_IO_TIM5
      #define CLK_ENABLE *((volatile UINT32 *)0x40023824) // RCC_APB1ENR
      #if ESCAPEMENT_TIMER ==  OS_IO_TIM2
         #define CLK_ENABLE_BIT 0x1
      #elif ESCAPEMENT_TIMER == OS_IO_TIM3
         #define CLK_ENABLE_BIT 0x2
      #elif ESCAPEMENT_TIMER == OS_IO_TIM4
         #define CLK_ENABLE_BIT 0x4
      #elif ESCAPEMENT_TIMER == OS_IO_TIM5
         #define CLK_ENABLE_BIT 0x8
      #endif
   #endif
#elif defined(STM32F1XXXX)
   #if ESCAPEMENT_TIMER == OS_IO_TIM1 || ESCAPEMENT_TIMER ==  OS_IO_TIM8 || \
       ESCAPEMENT_TIMER == OS_IO_TIM9 || ESCAPEMENT_TIMER == OS_IO_TIM10 || ESCAPEMENT_TIMER == OS_IO_TIM11 || \
       ESCAPEMENT_TIMER == OS_IO_TIM15 || ESCAPEMENT_TIMER == OS_IO_TIM16 || ESCAPEMENT_TIMER == OS_IO_TIM17
      #define CLK_ENABLE *((volatile UINT32 *)0x40021018) // RCC_APB2ENR
      #if ESCAPEMENT_TIMER == OS_IO_TIM1
         #define CLK_ENABLE_BIT 0x800
      #elif ESCAPEMENT_TIMER ==  OS_IO_TIM8
         #define CLK_ENABLE_BIT 0x2000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM9
         #define CLK_ENABLE_BIT 0x80000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM10
         #define CLK_ENABLE_BIT 0x100000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM11
         #define CLK_ENABLE_BIT 0x200000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM15
         #define CLK_ENABLE_BIT 0x10000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM16
         #define CLK_ENABLE_BIT 0x20000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM17
         #define CLK_ENABLE_BIT 0x40000
      #endif
   #elif ESCAPEMENT_TIMER ==  OS_IO_TIM2 || ESCAPEMENT_TIMER == OS_IO_TIM3 || \
         ESCAPEMENT_TIMER == OS_IO_TIM4 || ESCAPEMENT_TIMER == OS_IO_TIM5 || \
         ESCAPEMENT_TIMER == OS_IO_TIM12 || ESCAPEMENT_TIMER == OS_IO_TIM13 || \
         ESCAPEMENT_TIMER == OS_IO_TIM14
      #define CLK_ENABLE *((volatile UINT32 *)0x4002101C) // RCC_APB1ENR
      #if ESCAPEMENT_TIMER ==  OS_IO_TIM2
         #define CLK_ENABLE_BIT 0x1
      #elif ESCAPEMENT_TIMER == OS_IO_TIM3
         #define CLK_ENABLE_BIT 0x2
      #elif ESCAPEMENT_TIMER == OS_IO_TIM4
         #define CLK_ENABLE_BIT 0x4
      #elif ESCAPEMENT_TIMER == OS_IO_TIM5
         #define CLK_ENABLE_BIT 0x8
      #elif ESCAPEMENT_TIMER == OS_IO_TIM12
         #define CLK_ENABLE_BIT 0x40
      #elif ESCAPEMENT_TIMER == OS_IO_TIM13
         #define CLK_ENABLE_BIT 0x80
      #elif ESCAPEMENT_TIMER == OS_IO_TIM14
         #define CLK_ENABLE_BIT 0x100
      #endif
   #endif
#elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
   #if ESCAPEMENT_TIMER == OS_IO_TIM1 || ESCAPEMENT_TIMER == OS_IO_TIM8 || \
       ESCAPEMENT_TIMER == OS_IO_TIM9 || ESCAPEMENT_TIMER == OS_IO_TIM10 || ESCAPEMENT_TIMER == OS_IO_TIM11
      #define CLK_ENABLE *((volatile UINT32 *)0x40023844) // RCC_APB2ENR
      #if ESCAPEMENT_TIMER == OS_IO_TIM1
         #define CLK_ENABLE_BIT 0x1
      #elif ESCAPEMENT_TIMER == OS_IO_TIM8
         #define CLK_ENABLE_BIT 0x2
      #elif ESCAPEMENT_TIMER == OS_IO_TIM9
         #define CLK_ENABLE_BIT 0x10000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM10
         #define CLK_ENABLE_BIT 0x20000
      #elif ESCAPEMENT_TIMER == OS_IO_TIM11
         #define CLK_ENABLE_BIT 0x40000
      #endif
   #elif ESCAPEMENT_TIMER == OS_IO_TIM2 || ESCAPEMENT_TIMER == OS_IO_TIM3 || \
         ESCAPEMENT_TIMER == OS_IO_TIM4 || ESCAPEMENT_TIMER == OS_IO_TIM5 || \
         ESCAPEMENT_TIMER == OS_IO_TIM12 || ESCAPEMENT_TIMER == OS_IO_TIM13 || \
         ESCAPEMENT_TIMER == OS_IO_TIM14
      #define CLK_ENABLE *((volatile UINT32 *)0x40023840) // RCC_APB1ENR
      #if ESCAPEMENT_TIMER ==  OS_IO_TIM2
         #define CLK_ENABLE_BIT 0x1
      #elif ESCAPEMENT_TIMER == OS_IO_TIM3
         #define CLK_ENABLE_BIT 0x2
      #elif ESCAPEMENT_TIMER == OS_IO_TIM4
         #define CLK_ENABLE_BIT 0x4
      #elif ESCAPEMENT_TIMER == OS_IO_TIM5
         #define CLK_ENABLE_BIT 0x8
      #elif ESCAPEMENT_TIMER == OS_IO_TIM12
         #define CLK_ENABLE_BIT 0x40
      #elif ESCAPEMENT_TIMER == OS_IO_TIM13
         #define CLK_ENABLE_BIT 0x80
      #elif ESCAPEMENT_TIMER == OS_IO_TIM14
         #define CLK_ENABLE_BIT 0x100
      #endif
   #endif
#else
   #error STM32 version undefined
#endif


