beber007/escapement/Escapement/CORTEX-Mx/STM32/Escapement_Timer.c
/* Memory mapped timer registers relative to the base address of the timer */
#define TIM_CONTROL1         *((volatile UINT16 *)(TIME_BASE + 0x00))
#define TIM_INT_ENABLE       *((volatile UINT16 *)(TIME_BASE + 0x0C))
#define TIM_STATUS           *((volatile UINT16 *)(TIME_BASE + 0x10))
#define TIM_EVENT_GENERATION *((volatile UINT16 *)(TIME_BASE + 0x14))
#ifdef ESCAPEMENT_TIMER_32
   #define TIM_COUNTER       *((volatile UINT32 *)(TIME_BASE + 0x24))
#elif defined(ESCAPEMENT_TIMER_16)
   #define TIM_COUNTER       *((volatile UINT16 *)(TIME_BASE + 0x24))
#endif
#define TIM_PRESCALER        *((volatile UINT16 *)(TIME_BASE + 0x28))
#ifdef ESCAPEMENT_TIMER_32
   #define TIM_AUTORELOAD    *((volatile UINT32 *)(TIME_BASE + 0x2C))
   #define TIM_COMPARATOR    *((volatile UINT32 *)(TIME_BASE + 0x34))
#elif defined(ESCAPEMENT_TIMER_16)
   #define TIM_AUTORELOAD    *((volatile UINT16 *)(TIME_BASE + 0x2C))
   #define TIM_COMPARATOR    *((volatile UINT16 *)(TIME_BASE + 0x34))
#endif

#define UPDATE_INT_BIT      0x1
#define COMPARATOR_INT_BIT  0x2

/* Minimal interrupt descriptor to call an interrupt handler */
typedef struct TIMER_ISR_DATA {
  void (*TimerIntHandler)(struct TIMER_ISR_DATA *);
} TIMER_ISR_DATA;

#if ESCAPEMENT_TIMER == OS_IO_TIM1 || ESCAPEMENT_TIMER == OS_IO_TIM8
   static void TimerHandler_CC(struct TIMER_ISR_DATA *descriptor); // Interrupt handler for comparator interrupt
   static void TimerHandler_Up(struct TIMER_ISR_DATA *descriptor); // Interrupt handler for overflow
#else
   static void TimerHandler(struct TIMER_ISR_DATA *descriptor); // Interrupt handler for comparator and overflow interrupt
#endif


#ifdef ESCAPEMENT_TIMER_16
   /* System wall clock. This variable stores the most-significant 16 bits of the current
   ** time. The lower 16 bits are directly taken from the timer counter register. To get
   ** the current time, use _OSGetActualTime. */
   static volatile INT16 Time;
#endif

/* Timer interrupt cause marked by the ISR and that is used by the lower priority handler
** ( _OSTimerInterruptHandler) to process the interrupt. */
volatile BOOL _OSOverflowInterruptFlag = FALSE;
volatile BOOL _OSComparatorInterruptFlag = FALSE;

/* _OSInitializeTimer: Initializes the timer which starts counting as soon as Escapement is
** ready to process the first arrival. When the kernel, i.e. when OSStartMultitasking()
** is called, the last operation that is done is to set the timer handler and then start
** the idle task which is the only ready task in the system at that time. The first time
** the idle task executes, it calls _OSStartTimer().
** After _OSInitializeTimer() is called the timer's input divider is selected but it is
** halted. */
void _OSInitializeTimer(void)
{
  #define IRQ_SET_ENABLE_REGISTER 0xE000E100 // 0xE000E100 to 0xE000E11C (see CortexM3_TRM)
  #define IRQ_PRIORITY_REGISTER   0xE000E400 // 0xE000E400 to 0xE000E41F (see CortexM3_TRM)
  TIMER_ISR_DATA *device;
  #if defined(CORTEX_M3) || defined(CORTEX_M4)
     UINT8 tmpPriority;
     UINT32 *intSetEnable;
  #endif
  UINT8 *intPriorityLevel;
  CLK_ENABLE |= CLK_ENABLE_BIT;            // Enable the clock for timer
  #ifdef ESCAPEMENT_TIMER_32
     TIM_AUTORELOAD = 0x3FFFFFFF;          // Set the autoreload value (2^30 - 1)
  #elif defined(ESCAPEMENT_TIMER_16)
     TIM_AUTORELOAD = 0xFFFF;              // Set the autoreload value (2^16 - 1)
  #endif
  /* Set the timer clock prescaler to ESCAPEMENT_TIMER_PRESCALER. This value is defined in
  ** file Escapement_Config.h. */
  TIM_PRESCALER = ESCAPEMENT_TIMER_PRESCALER;
  TIM_EVENT_GENERATION = UPDATE_INT_BIT;   // Generate an update event to reload the prescaler
  TIM_STATUS = ~(UPDATE_INT_BIT | COMPARATOR_INT_BIT);   // Clear update flag
  TIM_INT_ENABLE |= UPDATE_INT_BIT | COMPARATOR_INT_BIT; // Enable update interrupt
  /* Initialize Cortex-Mx Nested Vectored Interrupt Controller */
  #if defined(CORTEX_M3) || defined(CORTEX_M4)
     /* Compute the priority (Only 4 bits are used for priority on STM32). PRIGROUP de-
     ** fines the interrupt priority levels of the microcontroller (see Escapement_Config.h),
     ** where 7-PRIGROUP is the number priority bits, and PRIGROUP-3 is the number of
     ** sub-priority bits */
     tmpPriority = TIMER_PRIORITY << (PRIGROUP - 3);
     tmpPriority |=  TIMER_SUB_PRIORITY & (0x0F >> (7 - PRIGROUP));
  #endif
  /* Set the IRQ priority */
  intPriorityLevel = (UINT8 *)(IRQ_PRIORITY_REGISTER + ((ESCAPEMENT_TIMER) & 0xFF));
  #if defined(CORTEX_M3) || defined(CORTEX_M4)
     *intPriorityLevel = tmpPriority << 4; // Only 4 MSB bits are used on STM32
  #elif defined(CORTEX_M0)
     *intPriorityLevel = TIMER_PRIORITY;
  #endif
  /* Enable the IRQ channels */
  #if defined(CORTEX_M3) || defined(CORTEX_M4)
     intSetEnable = (UINT32 *)IRQ_SET_ENABLE_REGISTER + (UINT32)(((ESCAPEMENT_TIMER) & 0xFF) / 32);
     *intSetEnable |= 0x01 << (((ESCAPEMENT_TIMER) & 0xFF) % 32);
  #elif defined(CORTEX_M0)
     *(UINT32 *)IRQ_SET_ENABLE_REGISTER |= 0x01 << ((ESCAPEMENT_TIMER) & 0xFF);
  #endif
  /* Initialize Escapement internal interrupt structure */
  #if ESCAPEMENT_TIMER == OS_IO_TIM1
     /* Comparator interrupt */
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler_CC;
     OSSetISRDescriptor(OS_IO_TIM1_CC,device);
     /* Update interrupt */
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler_Up;
     OSSetISRDescriptor(OS_IO_TIM1_UP,device);
     /* Set the IRQ priority */
     intPriorityLevel = (UINT8 *)(IRQ_PRIORITY_REGISTER + ((OS_IO_TIM1_UP) & 0xFF));
     #if defined(CORTEX_M3) || defined(CORTEX_M4)
        *intPriorityLevel = tmpPriority << 4; // Only 4 MSB bits are used on STM32
     #elif defined(CORTEX_M0)
        *intPriorityLevel = priority;
     #endif
     /* Enable the IRQ channels */
     #if defined(CORTEX_M3) || defined(CORTEX_M4)
        intSetEnable = (UINT32 *)IRQ_SET_ENABLE_REGISTER + (UINT32)(((OS_IO_TIM1_UP) & 0xFF) / 32);
        *intSetEnable |= 0x01 << (((OS_IO_TIM1_UP) & 0xFF) % 32);
     #elif defined(CORTEX_M0)
        *(UINT32 *)IRQ_SET_ENABLE_REGISTER |= 0x01 << ((OS_IO_TIM1_UP) & 0xFF);
     #endif
  #elif ESCAPEMENT_TIMER == OS_IO_TIM2 || ESCAPEMENT_TIMER == OS_IO_TIM3 || \
        ESCAPEMENT_TIMER == OS_IO_TIM4 || ESCAPEMENT_TIMER == OS_IO_TIM5 || \
        ESCAPEMENT_TIMER == OS_IO_TIM9 || ESCAPEMENT_TIMER == OS_IO_TIM10 || \
        ESCAPEMENT_TIMER == OS_IO_TIM11 || ESCAPEMENT_TIMER == OS_IO_TIM12 || \
        ESCAPEMENT_TIMER == OS_IO_TIM13 || ESCAPEMENT_TIMER == OS_IO_TIM14 || \
        ESCAPEMENT_TIMER == OS_IO_TIM15 || ESCAPEMENT_TIMER == OS_IO_TIM16 || \
        ESCAPEMENT_TIMER == OS_IO_TIM17
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler;
     OSSetISRDescriptor(ESCAPEMENT_TIMER,device);
  #elif ESCAPEMENT_TIMER == OS_IO_TIM8
     /* Comparator interrupt */
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler_CC;
     OSSetISRDescriptor(OS_IO_TIM8_CC,device);
     /* Update interrupt */
     device = (TIMER_ISR_DATA *)OSMalloc(sizeof(TIMER_ISR_DATA));
     device->TimerIntHandler = TimerHandler_Up;
     OSSetISRDescriptor(OS_IO_TIM8_UP,device);
     /* Set the IRQ priority */
     intPriorityLevel = (UINT8 *)(IRQ_PRIORITY_REGISTER + ((OS_IO_TIM8_UP) & 0xFF));
     #if defined(CORTEX_M3) || defined(CORTEX_M4)
        *intPriorityLevel = tmpPriority << 4; // Only 4 MSB bits are used on STM32
     #elif defined(CORTEX_M0)
        *intPriorityLevel = priority;
     #endif
     /* Enable the IRQ channels */
     #if defined(CORTEX_M3) || defined(CORTEX_M4)
        intSetEnable = (UINT32 *)IRQ_SET_ENABLE_REGISTER + (UINT32)(((OS_IO_TIM8_UP) & 0xFF) / 32);
        *intSetEnable |= 0x01 << (((OS_IO_TIM8_UP) & 0xFF) % 32);
     #elif defined(CORTEX_M0)
        *(UINT32 *)IRQ_SET_ENABLE_REGISTER |= 0x01 << ((OS_IO_TIM8_UP) & 0xFF);
     #endif
  #endif
} /* end of _OSInitializeTimer */


/* _OSStartTimer: Starts the interval timer by setting it to up mode. This function is
** called only once when the kernel is ready to schedule the first application task. */
void _OSStartTimer(void)
{
  /* Start counting from zero. The kernel computes its first arrival times from whatever
  ** the counter reads here, while the ones that follow are periods away from it; if the
  ** counter held a large value, the second round would find every task overdue at once and
  ** the overload guard would fire. A reset leaves the counter at zero, so this costs one
  ** store and removes an unstated requirement — the RP2040 port carries a time origin for
  ** the same reason, its counter being free running and impossible to clear. */
  TIM_COUNTER = 0;
  #ifdef ESCAPEMENT_TIMER_16
     Time = 0;                                // High half of the reconstructed clock
  #endif
  TIM_CONTROL1 |= 1;                          // Enable the TIM Counter
  TIM_EVENT_GENERATION |= COMPARATOR_INT_BIT; // Generate the first comparator interrupt
} /* end of _OSStartTimer */


/* _TimerHandler: Catches STM-32 Timer interrupts and generates a software timer interrupt
** which is then carried out at a lower priority.
** Note: This function could have been written in assembler to reduce interrupt latencies.
** Note: Timers 1 and 8 are have their overflow and comparator match interrupts bound to
** 2 different IRQs, and are therefore considered separately. */
#if ESCAPEMENT_TIMER == OS_IO_TIM1 || ESCAPEMENT_TIMER == OS_IO_TIM8
   void TimerHandler_Up(struct TIMER_ISR_DATA *descriptor)
   { // Timer overflow ISR
     TIM_STATUS = ~UPDATE_INT_BIT;  // Clear interrupt flag
     #ifdef ESCAPEMENT_TIMER_16
        Time += 1;                  // Increment most significant word of Time
     #endif
     _OSOverflowInterruptFlag = TRUE;
     _OSGenerateSoftTimerInterrupt();
   } /* end of TimerHandler_Up */

