beber007/escapement/Escapement/CORTEX-Mx/STM32/Escapement_Timer.c
   void TimerHandler_CC(struct TIMER_ISR_DATA *descriptor)
   { // Comparator match ISR
     TIM_STATUS = ~COMPARATOR_INT_BIT;  // Clear interrupt flag
     TIM_COMPARATOR = 0;                // Disable timer comparator
     _OSComparatorInterruptFlag = TRUE;
     _OSGenerateSoftTimerInterrupt();
   } /* end of TimerHandler_CC */
#else
   void TimerHandler(struct TIMER_ISR_DATA *descriptor)
   {
     if (TIM_STATUS & UPDATE_INT_BIT) {    // Is timer overflow interrupt?
        TIM_STATUS = ~UPDATE_INT_BIT;      // Clear interrupt flag
        #ifdef ESCAPEMENT_TIMER_16
           Time += 1;       // Increment most significant word of Time
        #endif
        _OSOverflowInterruptFlag = TRUE;
        _OSGenerateSoftTimerInterrupt();
     }
     if (TIM_STATUS & COMPARATOR_INT_BIT) { // Is comparator interrupt pending?
        TIM_STATUS = ~COMPARATOR_INT_BIT;   // Clear interrupt flag
        TIM_COMPARATOR = 0; // Disable timer comparator
        _OSComparatorInterruptFlag = TRUE;
        _OSGenerateSoftTimerInterrupt();
     }
   } /* end of TimerHandler */
#endif


/* _OSSetTimer: Sets the timer comparator to the next time event interval. This function
 * is called by the software timer interrupt handler when it finishes processing the cur-
 * rent interrupt and prepares its next interrupt. */
BOOL _OSSetTimer(INT32 nextArrival)
{
  #ifdef ESCAPEMENT_TIMER_32
     TIM_COMPARATOR = nextArrival;
     if (TIM_COMPARATOR > TIM_COUNTER)
        return TRUE;
     TIM_COMPARATOR = 0;
     return FALSE;
  #elif defined(ESCAPEMENT_TIMER_16)
     if (nextArrival >> 16 == Time) {
        TIM_COMPARATOR = (UINT16)nextArrival;
        if (TIM_COMPARATOR > TIM_COUNTER)
           return TRUE;
        TIM_COMPARATOR = 0;
        return FALSE;
     }
     else
        return TRUE;
#endif
} /* end of _OSSetTimer */


/* _OSTimerIsOverflow: Returns true if the increment to internal system wall clock over-
** flows and all time related values should be shifted. */
BOOL _OSTimerIsOverflow(INT32 shiftTimeLimit)
{
  #ifdef ESCAPEMENT_TIMER_32
     if (_OSOverflowInterruptFlag) {
        _OSOverflowInterruptFlag = FALSE;
        return TRUE;
     }
     else
        return FALSE;
  #elif defined(ESCAPEMENT_TIMER_16)
     INT16 tmp, time;
     if (_OSOverflowInterruptFlag) {
        _OSOverflowInterruptFlag = FALSE;
        if ((tmp = shiftTimeLimit >> 16) <= Time) {
           do {
              time = OSINT16_LL((INT16 *)&Time);
              time -= tmp;
           } while (!OSINT16_SC((INT16 *)&Time,time));
           return TRUE;
        }
     }
     return FALSE;
  #endif
} /* end of _OSTimerIsOverflow */


/* _OSGetActualTime: Retrieves the current time. When Escapement' interval timer is confi-
** gured for 16-bit timer, this function combines the 16 bits of the timer counter with
** the global variable Time to yield the current time. This function should never be
** called from an ISR having higher priority than ESCAPEMENT_TIMER_16. */
INT32 _OSGetActualTime(void)
{
  #ifdef ESCAPEMENT_TIMER_32
     return TIM_COUNTER;
  #elif defined(ESCAPEMENT_TIMER_16)
     INT16 currentTime;
     INT32 tmp;
     do {
        currentTime = Time;
        tmp = (INT32)currentTime << 16 | TIM_COUNTER;
     } while (currentTime != Time);
     return tmp;
  #endif
} /* end of _OSGetActualTime */
